/*
Navicat MySQL Data Transfer

Source Server         : msql
Source Server Version : 50716
Source Host           : localhost:3306
Source Database       : studb

Target Server Type    : MYSQL
Target Server Version : 50716
File Encoding         : 65001

Date: 2017-05-25 08:16:12
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for t_bookinfo
-- ----------------------------
DROP TABLE IF EXISTS `t_bookinfo`;
CREATE TABLE `t_bookinfo` (
  `bookid` varchar(50) NOT NULL,
  `isbn13` varchar(32) DEFAULT NULL,
  `isbn10` varchar(32) DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `publisher` varchar(50) DEFAULT NULL,
  `pubdate` varchar(32) DEFAULT NULL,
  `author` varchar(50) DEFAULT NULL,
  `price` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`bookid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_bookinfo
-- ----------------------------
INSERT INTO `t_bookinfo` VALUES ('021940a8-f9ff-4134-8138-208cd5eeb221', '9787313084699', '7313084692', '高考英语冲刺 听力', '', '2012-7', '\"杨菁华 编\"', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('02c7939e-6464-4981-9ac4-adb7e87b71f4', '9787313087324', '7313087322', '90后透视-大学生思想行为问题研究报告', '', '2012-7', '\"王莲华\"', '35.00元');
INSERT INTO `t_bookinfo` VALUES ('06e8325a-2e51-4e1f-ae0b-436d33603b2a', '9787313089120', '7313089120', '高校教材网·中国烹饪基本功训练教程', '', '2013-1', '\"李自立、谢维光\"', '');
INSERT INTO `t_bookinfo` VALUES ('0ed1d4eb-df38-4a00-8754-d51823c7a49b', '9787313084927', '7313084927', '国际货运代理理论与实务', '', '2012-7', '\"姚大伟\"', '48.00元');
INSERT INTO `t_bookinfo` VALUES ('10cce28a-5788-4575-a624-458398e5cc35', '9787313080813', '7313080816', '中介组织与社会运行', '', '2012-2', '', '29.00元');
INSERT INTO `t_bookinfo` VALUES ('12cbf964-9a42-4726-9bef-c24f9931b782', '9787313081711', '7313081715', '金融网络中资金流动异常识别研究', '', '2012-3', '', '35.00元');
INSERT INTO `t_bookinfo` VALUES ('1dc90b9f-b19d-4886-9824-418c0542beb6', '9787313087232', '7313087233', '消化道出血咨询', '', '2012-7', '', '18.00元');
INSERT INTO `t_bookinfo` VALUES ('299106f3-caf1-4282-9572-d5cb2d3c5c29', '9787313082664', '7313082665', 'Flash二维动画项目制作教程', '', '2012-6', '', '63.00元');
INSERT INTO `t_bookinfo` VALUES ('29996677-a1c4-4c8c-bdab-3f0334f3806e', '9787313082596', '7313082592', '企业云计算', '', '2012-6', '', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('39285b9d-70e1-4890-a668-a3700704d491', '9787313080097', '7313080093', 'Visual FoxPro程序设计', '', '2012-1', '', '32.00元');
INSERT INTO `t_bookinfo` VALUES ('3da438d1-1b66-4cd4-ac17-85b5eb2d6b48', '9787313082725', '731308272X', '日语流行口语200句', '', '2012-10', '\"周庆玲\"', '19.50元');
INSERT INTO `t_bookinfo` VALUES ('4070130e-c02f-4113-8901-fcba082337f9', '9787313084804', '7313084803', '新课标语文S版小学生写字课课练', '', '2012-6', '\"田英章\"', '12.00元');
INSERT INTO `t_bookinfo` VALUES ('41992c7e-5447-4810-bdb5-46655e4c4f49', '9787313089359', '731308935X', '初中英语同步阅读', '', '2012-9', '\"路言\"', '34.00元');
INSERT INTO `t_bookinfo` VALUES ('41f28942-7981-4b54-b7fe-a8767b4371df', '9787313081711', '7313081715', '金融网络中资金流动异常识别研究', '', '2012-3', '', '35.00元');
INSERT INTO `t_bookinfo` VALUES ('51466cca-c56d-4ec4-b359-e8d69029f797', '9787313081728', '7313081723', '本色语文谭丛', '', '2012-4', '\"杨先国\"', '186.00元');
INSERT INTO `t_bookinfo` VALUES ('53c9542c-448d-4449-8165-8953b150c78a', '9787313087812', '7313087810', '游艇概论', '上海交通大学出版社', '2012-9-1', '\"朱珉虎 编\"', '68.00元');
INSERT INTO `t_bookinfo` VALUES ('6a1911ba-e679-4405-9aca-aad3460994ea', '9787313084439', '7313084439', '英汉翻译中的汉语译文语料库研究', '上海交通大学出版社', '2012-6', '\"肖忠华\"', '40.00元');
INSERT INTO `t_bookinfo` VALUES ('6a1a47fe-fbd5-4cd5-9693-77dfc5db0b97', '9787313086457', '7313086458', '三笔字基础教程', '', '2012-12', '\"田英章\"', '30.00元');
INSERT INTO `t_bookinfo` VALUES ('6b760bbe-af7f-4f30-9d9b-3c41b06ffafe', '9787313084224', '7313084226', '操作系统', '', '', '', '');
INSERT INTO `t_bookinfo` VALUES ('72018841-a876-469c-af4b-37d277eb4745', '9787313089922', '7313089929', '数学期中期末满分冲刺卷', '', '2013-1', '', '18.00元');
INSERT INTO `t_bookinfo` VALUES ('747548a4-6202-4cd2-9530-ba05a21b620e', '9787313085160', '7313085168', '书法教师指导用书', '', '2012-7', '\"田英章\"', '15.00元');
INSERT INTO `t_bookinfo` VALUES ('77948d17-f26d-44cb-beea-f749f1f5ef12', '9787313080745', '7313080743', '民用飞机航空电子系统', '', '2011-12', '', '150.00元');
INSERT INTO `t_bookinfo` VALUES ('7a4654bd-6a65-4763-a1c2-9b434a4e0d5f', '9787313085146', '7313085141', '初中文言文精读精练精测', '', '2012-6', '', '22.00元');
INSERT INTO `t_bookinfo` VALUES ('7baacb94-1417-4880-9a41-1f192a82a736', '9787313080103', '7313080107', '新标准外研版-小学英语写字课课练-第八册-供三年级起始用', '', '2012-1', '\"龙文井\"', '12.00元');
INSERT INTO `t_bookinfo` VALUES ('7ea43743-2a3d-449b-95c2-29e4361b96cb', '9787313088901', '7313088906', '初中英语星级训练', '', '2012-8', '', '25.00元');
INSERT INTO `t_bookinfo` VALUES ('88cf9ace-ef1e-4f2f-9a2c-f9f29163b7fb', '9787313087324', '7313087322', '90后透视-大学生思想行为问题研究报告', '', '2012-7', '\"王莲华\"', '35.00元');
INSERT INTO `t_bookinfo` VALUES ('89465b28-a7af-4a2e-ab22-6ba90a7a925d', '9787313081636', '7313081634', '汽车保险与理赔一体化项目教程', '', '2012-6', '\"蔡文创\"', '40.00元');
INSERT INTO `t_bookinfo` VALUES ('8db292fb-a057-49c7-bb42-8d3031960da6', '9787313084682', '7313084684', '高考英语冲刺 翻译和写作', '', '2012-7', '\"范景 编\"', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('8f141a48-4b0a-4c2e-ae6e-0c25220b74ae', '9787313089632', '7313089635', '适航理念与原则', '上海交通大学出版社', '2013-8', '\"赵越让\"', '49.00元');
INSERT INTO `t_bookinfo` VALUES ('9116c7b8-57b4-4e26-97df-8198da6e70c5', '9787313084576', '7313084579', '现代企业管理教程', '', '', '', '');
INSERT INTO `t_bookinfo` VALUES ('916370f4-864f-41d8-8b46-3580981b895f', '9787313080554', '7313080557', '写字', '', '2012-1', '\"田英章\"', '12.00元');
INSERT INTO `t_bookinfo` VALUES ('93914556-dc8b-4dea-95bf-0d7b76710bc0', '9787313082329', '7313082320', '材料强韧学基础', '上海交通大学出版社', '2012-9', '', '38.00元');
INSERT INTO `t_bookinfo` VALUES ('951eb3b0-f43d-4e1f-9974-20c80a4697b1', '9787313084699', '7313084692', '高考英语冲刺 听力', '', '2012-7', '\"杨菁华 编\"', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('976f2986-2ec8-4848-933b-a9e22060883e', '9787313082350', '7313082355', '中华56个民族肤纹', '', '2012-5', '\"张海国\"', '148.00元');
INSERT INTO `t_bookinfo` VALUES ('992c7d7c-e08d-43dc-b479-03b0c40392fe', '9787313088161', '7313088167', '汽车专业英语一体化项目教程', '', '2012-8', '\"梁智敏 编\"', '26.00元');
INSERT INTO `t_bookinfo` VALUES ('a098af61-4a0e-4af7-acc2-3637438f65a8', '9787313082183', '7313082185', '宝宝一生的财富', '上海交通大学出版社', '2012-6', '', '228.00元');
INSERT INTO `t_bookinfo` VALUES ('a2e5abca-40c0-4d28-a780-e9e0c1adedb4', '9787313084781', '7313084781', '新课标语文版·初中生写字课课练8年级上', '', '2012-6', '\"田英章\"', '12.00元');
INSERT INTO `t_bookinfo` VALUES ('b2c3b743-78ab-4e72-8fd0-991d790c942c', '9787313086457', '7313086458', '三笔字基础教程', '', '2012-12', '\"田英章\"', '30.00元');
INSERT INTO `t_bookinfo` VALUES ('bd3d1bfb-f426-402c-9697-2ff162208b35', '9787313080257', '7313080255', '个人理财理论与实务', '', '2012-6', '\"祝小兵 编\"', '39.00元');
INSERT INTO `t_bookinfo` VALUES ('c0b6ce02-d225-44cf-b693-65772375ee05', '9787313085153', '731308515X', '书法教师指导用书（中学版）', '', '2012-7', '\"田英章\"', '20.00元');
INSERT INTO `t_bookinfo` VALUES ('c421b741-5c54-4dc2-8d21-5e2e617ceb1f', '9787313081490', '7313081499', '上海市高中学业水平考试试题及答案要点汇编', '', '', '\"上海市教育考试院\"', '12.00元');
INSERT INTO `t_bookinfo` VALUES ('c7258760-bf0a-4d5e-93d3-76e69c3468ab', '9787313087171', '7313087179', '票据法教程', '', '2012-9', '\"叶永禄 编\"', '42.00元');
INSERT INTO `t_bookinfo` VALUES ('c7b37403-68f8-45e0-b337-d0d0fca16b2b', '9787313083715', '7313083718', '英语语音简明教程', '', '2012-7', '', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('c88158a7-890e-42b1-a70a-04c2b355f558', '9787313088079', '7313088078', '唱游俄罗斯', '上海交通大学出版社', '2012-8', '\"戴逸如\"', '68.00元');
INSERT INTO `t_bookinfo` VALUES ('c9af7d6c-f6a9-4ad8-9d8e-19c47e62f3bd', '9787313080943', '7313080948', '公共文化行政学', '', '2012-3', '\"凌金铸\"', '32.00元');
INSERT INTO `t_bookinfo` VALUES ('d03572cf-69f5-45b6-b38c-10b344d20d6a', '9787313080684', '7313080689', '上海市普通高中学业水平测试', '', '2012-2', '\"蒋华 编\"', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('d06204a7-81c8-4e2d-b387-94dd52132e63', '9787313089106', '7313089104', '包装设计', '上海交通大学出版社', '2012-8', '\"张潇\"', '49.60元');
INSERT INTO `t_bookinfo` VALUES ('d576549d-93fc-488d-b00e-f6f79f975cb9', '9787313081223', '7313081227', '英语专业四级完形真题解密', '', '2012-6', '\"严明 编\"', '19.00元');
INSERT INTO `t_bookinfo` VALUES ('d7578858-b972-48bd-b886-66d1f470cdfa', '9787313082909', '7313082908', '高考英语核心词汇速记', '', '2012-5', '\"高胜长 编\"', '29.00元');
INSERT INTO `t_bookinfo` VALUES ('d7f756f7-aea1-4884-acd0-7eead2e94ffc', '9787313081223', '7313081227', '英语专业四级完形真题解密', '', '2012-6', '\"严明 编\"', '19.00元');
INSERT INTO `t_bookinfo` VALUES ('e59651ad-f220-4927-b2e1-2c9a23b7d89c', '9787313082404', '7313082401', '旅游英语/全国高等院校旅游管理类系列丛书', '', '2012-4', '', '35.00元');
INSERT INTO `t_bookinfo` VALUES ('ecc54fb0-ef50-4a8f-bacf-bc86b87fe0a6', '9787313082879', '7313082878', '中国企业发展年度报告', '', '2012-5', '\"王方华\"', '48.00元');
INSERT INTO `t_bookinfo` VALUES ('f2ea2c20-61de-44f9-b6c2-27ae9bececd1', '9787313089915', '7313089910', '概率论与数理统计试题分析与解答', '', '2012-9', '\"上海交通大学数学系 编\"', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('f3e40751-c63c-41d3-92f0-7d689d59f9f0', '123', '123', '测试', '测试', '1997.1.1', '测试', '30');
INSERT INTO `t_bookinfo` VALUES ('f601c06f-4e7e-4275-80ff-b6a470537bee', '9787313085016', '731308501X', '数学学业水平单元测试卷', '', '2012-6', '', '20.00元');
INSERT INTO `t_bookinfo` VALUES ('f642b02d-142a-4531-9d95-76bcc991ae9c', '9787313082282', '7313082282', '中考英语完形考前训练', '', '2012-5', '', '20.00元');
INSERT INTO `t_bookinfo` VALUES ('fac64e37-1d18-442a-8613-9357d039fe03', '9787313088055', '7313088051', '英译汉教程新编', '上海交通大学出版社', '2013-3', '\"马秉义 编\"', '36.00元');
INSERT INTO `t_bookinfo` VALUES ('fb2a3768-66fb-42ff-b8fb-b562bf1ba190', '9787313089809', '7313089805', '高级口译资格考试词汇', '上海交通大学出版社', '2013-3', '', '28.00元');
INSERT INTO `t_bookinfo` VALUES ('fcc0ff8e-6359-435a-879c-084b9ce9d438', '9787313080509', '7313080506', '汇率期限结构理论及实证研究', '', '2012-3', '', '32.00元');

-- ----------------------------
-- Table structure for t_user
-- ----------------------------
DROP TABLE IF EXISTS `t_user`;
CREATE TABLE `t_user` (
  `userid` varchar(32) NOT NULL,
  `pwd` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_user
-- ----------------------------
